snlkuharlocal/src/DataProcessors/КонтрольСписанияРегламентный/КонтрольСписанияРегламентный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтрольСписанияРегламентный</name>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/DataProcessors/КонтрольСписанияРегламентный/ObjectModule.bsl
/////////////// СЛУЖЕБНЫЕ ///////////////////////////////////////////////////////////////

Функция ПрочитатьHTMLИзФайла(Файл)
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.ОткрытьФайл(Файл, "UTF-8");
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	ЧтениеHTML.Закрыть();
	
	Возврат ПолучитьТекстHTML(ДокументHTML);
	
КонецФункции

Функция ПолучитьТекстHTML(ДокументHTML)
	
	ЗапиcьHTML = Новый ЗаписьHTML;
	ЗапиcьHTML.УстановитьСтроку();
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументHTML, ЗапиcьHTML);
	
	Возврат ЗапиcьHTML.Закрыть();
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	СформироватьОтчет(ТаблицаПараметров);
КонецПроцедуры

Процедура СформироватьОтчет(ТаблицаПараметров)
	// Кухарь А.Ю.  31.05.2022 начало
	//
	ФизСкл=новый Массив; 
	СписокПолучателей=новый СписокЗначений;
	СтрокаПараметров="";
	// Кухарь А.Ю.  31.05.2022 конец
	
	Если ТаблицаПараметров <> Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			
			// Кухарь А.Ю.  31.05.2022 начало
			//Для записи в лог
			СтрокаПараметров=СтрокаПараметров+", Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение; 
			// Кухарь А.Ю.  31.05.2022 конец
			
			
			Если СтрокаТП.Имя = "Склад" Тогда			
				// Кухарь А.Ю.  31.05.2022 начало
				ФизСкл.Добавить(СтрокаТП.Значение);
				// Кухарь А.Ю.  31.05.2022 конец
			КонецЕсли;
			
			
			// Кухарь А.Ю.  31.05.2022 начало
			//
			Если СтрокаТП.Имя = "Получатель" Тогда			
				// Кухарь А.Ю.  31.05.2022 начало
				СписокПолучателей.Добавить(СтрокаТП.Значение);
				// Кухарь А.Ю.  31.05.2022 конец
			КонецЕсли;
			
			// Кухарь А.Ю.  31.05.2022 конец
			
		КонецЦикла;
	КонецЕсли;
	
	// Кухарь А.Ю.  31.05.2022 начало
	//
	ЗаписатьВЛог("Регламент",СтрокаПараметров,"Информация");
	
	если ФизСкл.Количество()=0  тогда 
		ЗаписатьВЛог("Регламент","Не выбрали склады","Информация");
		
		Возврат;
	КонецЕсли;
	
	если СписокПолучателей.Количество()=0 тогда
		ЗаписатьВЛог("Регламент","Не выбрали получателей","Информация");	
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю.  31.05.2022 конец
	
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Отчет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ
	|	РезервыТМЦОстатки.Номенклатура КАК Номенклатура,
	|	РезервыТМЦОстатки.Склад КАК Склад,
	|	СУММА(РезервыТМЦОстатки.КоличествоОстаток) КАК Резерв
	|ПОМЕСТИТЬ ТЗОстаткиРезервов
	|ИЗ
	|	РегистрНакопления.РезервыТМЦ.Остатки(&Кон, Склад В ИЕРАРХИИ (&ФизСкл)) КАК РезервыТМЦОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервыТМЦОстатки.Номенклатура,
	|	РезервыТМЦОстатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, ТЗОстаткиРезервов.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Склад, ТЗОстаткиРезервов.Склад) КАК Склад,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТЗОстаткиРезервов.Резерв, 0)) КАК СвободныйОстаток
	|ПОМЕСТИТЬ ТЗМинусовНаТекПериод
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Кон, Склад В ИЕРАРХИИ (&ФизСкл)) КАК ОстаткиТМЦОстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТЗОстаткиРезервов КАК ТЗОстаткиРезервов
	|		ПО ОстаткиТМЦОстатки.Склад = ТЗОстаткиРезервов.Склад
	|			И ОстаткиТМЦОстатки.Номенклатура = ТЗОстаткиРезервов.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, ТЗОстаткиРезервов.Номенклатура),
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Склад, ТЗОстаткиРезервов.Склад)
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТЗОстаткиРезервов.Резерв, 0)) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т1.Склад КАК Склад,
	|	т1.Номенклатура КАК Номенклатура,
	|	т1.CвободныйОстаток КАК CвободныйОстаток,
	|	т1.Период КАК Период,
	|	т1.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТЗДвижений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиТМЦОстаткиИОбороты.Склад КАК Склад,
	|		ОстаткиТМЦОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|		ОстаткиТМЦОстаткиИОбороты.КоличествоКонечныйОстаток КАК CвободныйОстаток,
	|		ЕСТЬNULL(ОстаткиТМЦОстаткиИОбороты.ПериодСекунда, &Кон) КАК Период,
	|		ОстаткиТМЦОстаткиИОбороты.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Нач, &Кон, Авто, Движения, Склад В ИЕРАРХИИ (&ФизСкл)) КАК ОстаткиТМЦОстаткиИОбороты
	|	ГДЕ
	|		ОстаткиТМЦОстаткиИОбороты.КоличествоРасход > 0) КАК т1
	|ГДЕ
	|	т1.CвободныйОстаток < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т1.Склад КАК Склад,
	|	т1.Номенклатура КАК Номенклатура,
	|	т1.Номенклатура.Код КАК Код,
	|	т1.Период КАК Период,
	|	т1.Регистратор КАК Регистратор,
	|	т1.СвободныйОстаток КАК СвободныйОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТЗДвижений.Склад КАК Склад,
	|		ТЗДвижений.Номенклатура КАК Номенклатура,
	|		ТЗДвижений.CвободныйОстаток КАК СвободныйОстаток,
	|		ТЗДвижений.Период КАК Период,
	|		ТЗДвижений.Регистратор КАК Регистратор
	|	ИЗ
	|		ТЗДвижений КАК ТЗДвижений
	|	ГДЕ
	|		НЕ ТЗДвижений.Регистратор ЕСТЬ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТЗМинусовНаТекПериод.Склад,
	|		ТЗМинусовНаТекПериод.Номенклатура,
	|		СУММА(ТЗМинусовНаТекПериод.СвободныйОстаток),
	|		&Кон,
	|		NULL
	|	ИЗ
	|		ТЗМинусовНаТекПериод КАК ТЗМинусовНаТекПериод
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТЗМинусовНаТекПериод.Склад,
	|		ТЗМинусовНаТекПериод.Номенклатура) КАК т1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Нач", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Кон", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ФизСкл", ФизСкл);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	// Кухарь А.Ю.  10.06.2022 начало
	//
	ДругойЦвет=ложь;
	СтарыйСклад=Неопределено;
	СтараяНоменклатура=Неопределено;
	// Кухарь А.Ю.  10.06.2022 конец
	
	Пока Результат.Следующий() Цикл
		// Кухарь А.Ю.  10.06.2022 начало
		//
		НоваяНоменклатура=Результат.Номенклатура;
		НовыйСклад=Результат.склад;
		если СтарыйСклад<>НовыйСклад или СтараяНоменклатура<>НоваяНоменклатура тогда
			ДругойЦвет=не ДругойЦвет;
		КонецЕсли;
		ОблОкраски=ОбластьНоменклатура.Область("ОбластьПокраски");
		
		если ДругойЦвет тогда
			ОблОкраски.ЦветФона=новый Цвет(255, 255, 153);
		иначе
			ОблОкраски.ЦветФона=новый Цвет(204, 255, 255);
		КонецЕсли;
		// Кухарь А.Ю.  10.06.2022 конец
		
		
		ОбластьНоменклатура.Параметры.Заполнить(Результат);
		// Кухарь А.Ю.  10.06.2022 начало
		//
		если не ЗначениеЗаполнено(ОбластьНоменклатура.Параметры.Регистратор) тогда
			ОбластьНоменклатура.Параметры.Регистратор=" Минус на конец периода ";
		КонецЕсли;
		// Кухарь А.Ю.  10.06.2022 конец
		
		ТабДок.Вывести(ОбластьНоменклатура);
		
		СтараяНоменклатура=НоваяНоменклатура;
		СтарыйСклад=НовыйСклад;
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	ИмяФайла = КаталогВременныхФайлов() + "КонтрольСписания.html";
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
	//СписокПолучателей = Новый СписокЗначений;
	//СписокПолучателей.Добавить("nikolaev@collant.ru");
	ТекстСообщения = "Минуса во вложении.";
	СформироватьВнутреннееУведомление(СписокПолучателей,ТекстСообщения, "Контроль списания", Неопределено, , ИмяФайла);
	
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");
	
КонецПроцедуры
